LuaVan/Luan_van/src/Enums/PerformerRoles/PerformerRoles.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>PerformerRoles</name>
  <enumValues>
    <name>Head</name>
  </enumValues>
  <enumValues>
    <name>InstitutionalHead</name>
  </enumValues>
  <enumValues>
    <name>Dean</name>
  </enumValues>
</mdclass:Enum>

LuaVan/Luan_van/src/Enums/ApprovalLevel/ApprovalLevel.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ApprovalLevel</name>
  <enumValues>
    <name>Faculty</name>
  </enumValues>
  <enumValues>
    <name>FacultyCouncil</name>
  </enumValues>
  <enumValues>
    <name>InstitutionalCouncil</name>
  </enumValues>
  <enumValues>
    <name>BoardOfTrustees</name>
  </enumValues>
</mdclass:Enum>

LuaVan/Luan_van/src/Documents/ProgramProposal/ProgramProposal.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ProgramProposal</name>
  <registerRecords>InformationRegister.ProgramValidity</registerRecords>
  <registerRecords>InformationRegister.ApprovalLog</registerRecords>
  <attributes>
    <name>ProposingFaculty</name>
    <type>
      <types>CatalogRef.Faculties</types>
    </type>
  </attributes>
  <attributes>
    <name>Proposer</name>
    <type>
      <types>CatalogRef.Lecturers</types>
    </type>
  </attributes>
  <attributes>
    <name>TargetProgram</name>
    <type>
      <types>CatalogRef.TrainingPrograms</types>
    </type>
  </attributes>
  <attributes>
    <name>ProposalSummary</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Status</name>
    <type>
      <types>EnumRef.ProgramStatuses</types>
    </type>
  </attributes>
</mdclass:Document>

LuaVan/Luan_van/src/Catalogs/Lecturers/Lecturers.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Lecturers</name>
  <owners>Catalog.Faculties</owners>
  <attributes>
    <name>AcademicTitle</name>
    <type>
      <types>EnumRef.AcademicTitles</types>
    </type>
  </attributes>
  <attributes>
    <name>DateOfBirth</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Gender</name>
    <type>
      <types>EnumRef.Genders</types>
    </type>
  </attributes>
  <attributes>
    <name>Email</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Phone</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>JoinDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ResearchAreas</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Active</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>SystemRoles</name>
    <attributes>
      <name>Role</name>
      <type>
        <types>EnumRef.UserRoles</types>
      </type>
    </attributes>
    <attributes>
      <name>AssignedDate</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ExpiryDate</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

LuaVan/Luan_van/src/CommonModules/WorkflowAddressing/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// WorkflowAddressing — Tìm người thực hiện Task động theo Role
//
// Dùng trong BeforeCreateTasks handlers của BusinessProcess và Task.BeforeWrite.
// Tránh hard-code Lecturer code, linh hoạt khi đổi nhân sự.
////////////////////////////////////////////////////////////////////////////////

#Region PublicAPI

// Tìm Trưởng BM / Trưởng Khoa cho Faculty cụ thể (Role=Head, Active=True).
// Thứ tự ưu tiên:
//   1. Trùng khớp Faculty
//   2. Faculty cha (lên Khoa nếu Faculty là BM)
//   3. BM cùng cấp (sibling BM trong cùng Khoa)
//   4. Bất kỳ Head nào trong toàn hệ thống (fallback cuối)
Function FindHead(Val Faculty) Export
	If Faculty.IsEmpty() Then
		Return FindAnyHead();
	EndIf;

	Found = FindHeadInFaculty(Faculty);
	If Not Found.IsEmpty() Then
		Return Found;
	EndIf;

	If ValueIsFilled(Faculty.Parent) Then
		Found = FindHeadInFaculty(Faculty.Parent);
		If Not Found.IsEmpty() Then
			Return Found;
		EndIf;

		Query = New Query;
		Query.Text =
		"SELECT TOP 1
		|	Lecturers.Ref AS Ref
		|FROM
		|	Catalog.Lecturers AS Lecturers
		|		INNER JOIN Catalog.Faculties AS F
		|		ON Lecturers.Owner = F.Ref
		|WHERE
		|	F.Parent = &ParentFaculty
		|	AND Lecturers.Role = VALUE(Enum.PerformerRoles.Head)
		|	AND Lecturers.Active = TRUE";
		Query.SetParameter("ParentFaculty", Faculty.Parent);
		Sel = Query.Execute().Select();
		If Sel.Next() Then
			Return Sel.Ref;
		EndIf;
	EndIf;

	Return FindAnyHead();
EndFunction

Function FindHeadInFaculty(Val Faculty)
	Query = New Query;
	Query.Text =
	"SELECT TOP 1 Lecturers.Ref AS Ref
	|FROM Catalog.Lecturers AS Lecturers
	|WHERE Lecturers.Owner = &Faculty
	|  AND Lecturers.Role = VALUE(Enum.PerformerRoles.Head)
	|  AND Lecturers.Active = TRUE";
	Query.SetParameter("Faculty", Faculty);
	Sel = Query.Execute().Select();
	If Sel.Next() Then
		Return Sel.Ref;
	EndIf;
	Return Catalogs.Lecturers.EmptyRef();
EndFunction

Function FindAnyHead()
	Query = New Query;
	Query.Text =
	"SELECT TOP 1 Lecturers.Ref AS Ref
	|FROM Catalog.Lecturers AS Lecturers
	|WHERE Lecturers.Role = VALUE(Enum.PerformerRoles.Head)
	|  AND Lecturers.Active = TRUE";
	Sel = Query.Execute().Select();
	If Sel.Next() Then
		Return Sel.Ref;
	EndIf;
	Return Catalogs.Lecturers.EmptyRef();
EndFunction

// Tìm Trưởng PĐT / HĐKHĐT (Role=InstitutionalHead, Active=True)
Function FindInstitutionalHead() Export
	Query = New Query;
	Query.Text =
	"SELECT TOP 1 Lecturers.Ref AS Ref
	|FROM Catalog.Lecturers AS Lecturers
	|WHERE Lecturers.Role = VALUE(Enum.PerformerRoles.InstitutionalHead)
	|  AND Lecturers.Active = TRUE";
	Selection = Query.Execute().Select();
	If Selection.Next() Then
		Return Selection.Ref;
	EndIf;
	Return Catalogs.Lecturers.EmptyRef();
EndFunction

// Tìm Giám đốc (Role=Dean, Active=True)
Function FindDean() Export
	Query = New Query;
	Query.Text =
	"SELECT TOP 1 Lecturers.Ref AS Ref
	|FROM Catalog.Lecturers AS Lecturers
	|WHERE Lecturers.Role = VALUE(Enum.PerformerRoles.Dean)
	|  AND Lecturers.Active = TRUE";
	Selection = Query.Execute().Select();
	If Selection.Next() Then
		Return Selection.Ref;
	EndIf;
	Return Catalogs.Lecturers.EmptyRef();
EndFunction

// Tìm 1 Lecturer bất kỳ trong Faculty (fallback cho T1 - Soạn đề xuất)
Function FindAnyLecturerInFaculty(Val Faculty) Export
	If Faculty.IsEmpty() Then
		Return Catalogs.Lecturers.EmptyRef();
	EndIf;
	Query = New Query;
	Query.Text =
	"SELECT TOP 1 Lecturers.Ref AS Ref
	|FROM Catalog.Lecturers AS Lecturers
	|WHERE Lecturers.Owner = &Faculty
	|  AND Lecturers.Active = TRUE";
	Query.SetParameter("Faculty", Faculty);
	Selection = Query.Execute().Select();
	If Selection.Next() Then
		Return Selection.Ref;
	EndIf;
	Return Catalogs.Lecturers.EmptyRef();
EndFunction

// Lấy Proposer (người tạo ProgramProposal mới nhất) cho 1 CTĐT.
// Không filter Posted=TRUE để bắt cả document đang trong transaction.
Function GetProposerOfProgram(Val TargetProgram) Export
	If TargetProgram.IsEmpty() Then
		Return Catalogs.Lecturers.EmptyRef();
	EndIf;
	Query = New Query;
	Query.Text =
	"SELECT TOP 1 ProgramProposal.Proposer AS Proposer
	|FROM Document.ProgramProposal AS ProgramProposal
	|WHERE ProgramProposal.TargetProgram = &TargetProgram
	|ORDER BY ProgramProposal.Date DESC";
	Query.SetParameter("TargetProgram", TargetProgram);
	Selection = Query.Execute().Select();
	If Selection.Next() Then
		Return Selection.Proposer;
	EndIf;
	Return Catalogs.Lecturers.EmptyRef();
EndFunction

// Map InfoBaseUser hiện tại → Catalog.Lecturers theo Lecturer.Code = User.Name
Function GetCurrentLecturer() Export
	CurrentUser = InfoBaseUsers.CurrentUser();
	If CurrentUser = Undefined Or IsBlankString(CurrentUser.Name) Then
		Return Catalogs.Lecturers.EmptyRef();
	EndIf;
	Query = New Query;
	Query.Text =
	"SELECT TOP 1 Lecturers.Ref AS Ref
	|FROM Catalog.Lecturers AS Lecturers
	|WHERE Lecturers.Code = &Login";
	Query.SetParameter("Login", CurrentUser.Name);
	Selection = Query.Execute().Select();
	If Selection.Next() Then
		Return Selection.Ref;
	EndIf;
	Return Catalogs.Lecturers.EmptyRef();
EndFunction

// Lookup Faculty đề xuất từ ProgramProposal mới nhất gắn với CTĐT.
// Không filter Posted=TRUE để bắt cả document đang trong transaction.
Function GetProposingFaculty(Val TargetProgram) Export
	If TargetProgram.IsEmpty() Then
		Return Catalogs.Faculties.EmptyRef();
	EndIf;
	Query = New Query;
	Query.Text =
	"SELECT TOP 1 ProgramProposal.ProposingFaculty AS Faculty
	|FROM Document.ProgramProposal AS ProgramProposal
	|WHERE ProgramProposal.TargetProgram = &TargetProgram
	|ORDER BY ProgramProposal.Date DESC";
	Query.SetParameter("TargetProgram", TargetProgram);
	Selection = Query.Execute().Select();
	If Selection.Next() Then
		Return Selection.Faculty;
	EndIf;
	Return Catalogs.Faculties.EmptyRef();
EndFunction

// Suy ra Context (TargetProgram + ApprovalLevel) từ Task,
// dùng cho nút "Phê duyệt CTĐT" trên Task form để auto-fill ProgramApproval.
Function GetApprovalContextFromTask(Val TaskRef) Export
	Result = New Structure;
	Result.Insert("TargetProgram", Catalogs.TrainingPrograms.EmptyRef());
	Result.Insert("ApprovalLevel", Enums.ApprovalLevel.EmptyRef());

	If TaskRef = Undefined Or TaskRef.IsEmpty() Then
		Return Result;
	EndIf;

	BP = TaskRef.BusinessProcess;
	If Not BP.IsEmpty() Then
		Result.TargetProgram = BP.TargetProgram;
	EndIf;

	Desc = Upper(TrimAll(String(TaskRef.Description)));
	If StrStartsWith(Desc, "T2") Then
		Result.ApprovalLevel = Enums.ApprovalLevel.FacultyCouncil;
	ElsIf StrStartsWith(Desc, "T3") Then
		Result.ApprovalLevel = Enums.ApprovalLevel.InstitutionalCouncil;
	ElsIf StrStartsWith(Desc, "T4") Then
		Result.ApprovalLevel = Enums.ApprovalLevel.Issued;
	EndIf;

	Return Result;
EndFunction

#EndRegion
